import styles from "@/app/page.module.css";

export const WhyWe = (props) => {
    return (
        <div className={styles["mainWe"]}>
            <div className={styles["Info"]}>
                <h1 className={styles["mainTXTwe"]}>ПОЧЕМУ ВЫБИРАЮТ НАС</h1><br/>
                <div className={styles["prems"]}>
                    <div className={styles["prem1"]}>
                        <svg
                            xmlns="http://www.w3.org/2000/svg"
                            width={39}
                            height={32}
                            fill="none"
                            {...props}
                        >
                            <path
                            fill="#000"
                            d="M32.667 6.378a19.069 19.069 0 0 0-9.798-5.298 18.932 18.932 0 0 0-11.056 1.102 19.185 19.185 0 0 0-8.588 7.13A19.518 19.518 0 0 0 0 20.065v7.098h11.481v-2.581h-8.93v-4.517c0-9.25 7.44-16.777 16.585-16.777 9.144 0 16.584 7.526 16.584 16.777v4.517h-8.93v2.58H38.27v-7.097a19.423 19.423 0 0 0-1.447-7.412 19.245 19.245 0 0 0-4.157-6.276Z"
                            />
                            <path
                            fill="#000"
                            d="M7.654 16.194H5.103v2.581h2.551v-2.58ZM20.411 5.225H17.86v2.581h2.551V5.225ZM12.12 8.451H9.567v2.581h2.551v-2.58ZM33.169 16.194h-2.552v2.581h2.552v-2.58ZM22.422 21.93 27.94 10.3l-2.3-1.116-5.517 11.625a5.064 5.064 0 0 0-3.565.599 5.161 5.161 0 0 0-2.284 2.834 5.23 5.23 0 0 0 .139 3.653 5.149 5.149 0 0 0 2.492 2.649 5.06 5.06 0 0 0 3.6.32 5.119 5.119 0 0 0 2.911-2.168 5.222 5.222 0 0 0 .767-3.574 5.19 5.19 0 0 0-1.76-3.193Zm-3.286 6.524a2.53 2.53 0 0 1-1.418-.435 2.575 2.575 0 0 1-.94-1.158 2.608 2.608 0 0 1 .554-2.813 2.525 2.525 0 0 1 2.78-.56c.466.196.865.527 1.145.951a2.602 2.602 0 0 1-.318 3.258 2.54 2.54 0 0 1-1.803.757Z"
                            />
                        </svg>
                        <br/><br/>
                        <p className={styles["bigpremtxt"]}>Быстрое <br/>создание</p><br/>   
                        <p className={styles["smallpremtxt"]}>Интуитивный конструктор поможет запустить опрос за 2 минуты.</p>
                    </div>
                    <div className={styles["prem1"]}>
                    <svg
                        xmlns="http://www.w3.org/2000/svg"
                        width={25}
                        height={33}
                        fill="none"
                        {...props}
                    >
                        <path
                        fill="#fff"
                        d="M20.125 16.668h2.538c.6 0 1.087.493 1.087 1.1v12.468c0 .608-.487 1.1-1.087 1.1H3.087c-.6 0-1.087-.492-1.087-1.1V17.768c0-.607.487-1.1 1.087-1.1h2.538m14.5 0V9.334c0-2.445-1.45-7.334-7.25-7.334s-7.25 4.89-7.25 7.334v7.334m14.5 0h-14.5 14.5Z"
                        />
                        <path
                        stroke="#000"
                        strokeLinecap="round"
                        strokeLinejoin="round"
                        strokeWidth={2.51}
                        d="M20.125 16.668h2.538c.6 0 1.087.493 1.087 1.1v12.468c0 .608-.487 1.1-1.087 1.1H3.087c-.6 0-1.087-.492-1.087-1.1V17.768c0-.607.487-1.1 1.087-1.1h2.538m14.5 0V9.334c0-2.445-1.45-7.334-7.25-7.334s-7.25 4.89-7.25 7.334v7.334m14.5 0h-14.5"
                        />
                    </svg>
                    <br/><br/>
                        <p className={styles["bigpremtxt"]}>Безопасность <br/> данных</p><br/>
                        <p className={styles["smallpremtxt"]}>Все опросы защищены HTTPS, а данные хранятся на надежных серверах.</p>
                    </div>
                    <div className={styles["prem1"]}>
                    <svg
                        xmlns="http://www.w3.org/2000/svg"
                        width={30}
                        height={30}
                        fill="none"
                        {...props}
                        >
                        <path
                        fill="#000"
                        d="M28.372 29.739H5.128C2.298 29.739 0 27.415 0 24.552V1.037C0 .47.465 0 1.026 0c.56 0 1.025.47 1.025 1.037v23.515c0 1.715 1.381 3.112 3.077 3.112h23.244c.56 0 1.026.47 1.026 1.037s-.465 1.038-1.026 1.038Z"
                        />
                        <path
                        fill="#000"
                        d="M5.127 22.823c-.232 0-.478-.084-.67-.25a1.054 1.054 0 0 1-.11-1.466l6.277-7.414a3.768 3.768 0 0 1 2.707-1.327 3.8 3.8 0 0 1 2.803 1.106l1.3 1.314c.341.346.779.512 1.27.512a1.664 1.664 0 0 0 1.232-.609l6.276-7.414a1.026 1.026 0 0 1 1.449-.11c.424.373.479 1.023.11 1.466l-6.277 7.414a3.767 3.767 0 0 1-2.707 1.328 3.778 3.778 0 0 1-2.803-1.107l-1.285-1.314a1.7 1.7 0 0 0-1.272-.512 1.665 1.665 0 0 0-1.23.609L5.92 22.463c-.218.235-.506.36-.793.36Z"
                        />
                        </svg>
                    <br/><br/>
                        <p className={styles["bigpremtxt"]}>Результаты <br/> в реальном времени</p><br/>
                        <p className={styles["smallpremtxt"]}>Удобная подача информации в виде диаграмм и таблиц</p>
                    </div>
                </div>
            </div>
            <img src="/images/5.png" className={styles["imgsha"]}/>
        </div>
    );
}